### Pandas

In [1]:
import pandas as pd

In [7]:
### series
import pandas as pd
data=[1,2,3,4,5,6]
series=pd.Series(data)
print("series:\n",series)
print(type(series))

series:
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
##create aseries form dictinoaries
data={
    "A":1,
    "b":2,
    "c":3,
}
series_dictionaries=pd.Series(data)
print(series_dictionaries)

A    1
b    2
c    3
dtype: int64

In [9]:
data=[10,20,30]
indexe=["a","b","c"]
pd.Series(data,indexe)

a    10
b    20
c    30
dtype: int64

In [12]:
##data frame
##create a dtata frame from the list
data={
    "Name":["barash","shivang","john","jack"],
    "age":[25,30,45,22],
    "city":["banglore","delhi","mumbai","punjab"],
}
fd=pd.DataFrame(data)
print(fd)
print(type(fd))

      Name  age      city
0   barash   25  banglore
1  shivang   30     delhi
2     john   45    mumbai
3     jack   22    punjab
<class 'pandas.core.frame.DataFrame'>

In [13]:
import numpy as np
np.array(fd)

array([['barash', 25, 'banglore'],
       ['shivang', 30, 'delhi'],
       ['john', 45, 'mumbai'],
       ['jack', 22, 'punjab']], dtype=object)

In [14]:
##create a datafroma from list of dictionary
data=[
    {
    "NAME":"BARASH",
     "AGE":24,
     "CITY":"BANGALORE",
    },
    {
    "NAME":"SHIVANG",
     "AGE":44,
     "CITY":"DELHI",
    },
    {
    "NAME":"KARAN",
     "AGE":34,
     "CITY":"MUMBAI",
    },
]
df=pd.DataFrame(data)
print(df)

      NAME  AGE       CITY
0   BARASH   24  BANGALORE
1  SHIVANG   44      DELHI
2    KARAN   34     MUMBAI

In [15]:
sales=pd.read_csv("SaleData.csv")

In [22]:
sales.head(5)
sales.tail(5)

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
40,11/17/19,Central,Hermann,Luis,Home Theater,11.00,500.00,"5,500.00"
41,12/4/19,Central,Hermann,Luis,Home Theater,94.00,500.00,"47,000.00"
42,12/21/19,Central,Martha,Steven,Home Theater,28.00,500.00,"14,000.00"
43,NaN,NaN,NaN,NaN,NaN,278.00,"1,125.00","62,550.00"
44,NaN,NaN,NaN,NaN,NaN,34.75,140.63,"7,818.75"

In [23]:
data

[{'NAME': 'BARASH', 'AGE': 24, 'CITY': 'BANGALORE'},
 {'NAME': 'SHIVANG', 'AGE': 44, 'CITY': 'DELHI'},
 {'NAME': 'KARAN', 'AGE': 34, 'CITY': 'MUMBAI'}]

In [24]:
df

      NAME  AGE       CITY
0   BARASH   24  BANGALORE
1  SHIVANG   44      DELHI
2    KARAN   34     MUMBAI

In [27]:
type(df["NAME"])

pandas.core.series.Series

In [29]:
df.loc[0]

NAME       BARASH
AGE            24
CITY    BANGALORE
Name: 0, dtype: object

In [34]:
fd.loc[0][0]

C:\Users\b12b3\AppData\Local\Temp\ipykernel_17876\2834457146.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  fd.loc[0][0]

'barash'

In [44]:
##accesing the specified
df.at[0,'NAME']

'BARASH'

In [46]:
##iat
df.iat[2,2]

'MUMBAI'

In [47]:
df

      NAME  AGE       CITY
0   BARASH   24  BANGALORE
1  SHIVANG   44      DELHI
2    KARAN   34     MUMBAI

In [48]:
##data manipulation with data frames
## additng a column
df["salary"]=[5000,5300,300]

In [49]:
df

      NAME  AGE       CITY  salary
0   BARASH   24  BANGALORE    5000
1  SHIVANG   44      DELHI    5300
2    KARAN   34     MUMBAI     300

In [52]:
df.drop("salary",axis=1,inplace=True)

In [53]:
df

      NAME  AGE       CITY
0   BARASH   24  BANGALORE
1  SHIVANG   44      DELHI
2    KARAN   34     MUMBAI

In [54]:
## add age to the colum
df["AGE"]=df["AGE"]+1

In [55]:
DF

NameError: name 'DF' is not defined

In [56]:
df

      NAME  AGE       CITY
0   BARASH   25  BANGALORE
1  SHIVANG   45      DELHI
2    KARAN   35     MUMBAI

In [57]:
df.drop(0,inplace=True)

In [58]:
df

      NAME  AGE    CITY
1  SHIVANG   45   DELHI
2    KARAN   35  MUMBAI

In [59]:
df.head(0)

Empty DataFrame
Columns: [NAME, AGE, CITY]
Index: []

In [60]:
df=pd.read_csv("./SaleData.csv")

In [64]:
df.describe()

            Units
count   45.000000
mean    54.083333
std     45.096676
min      2.000000
25%     28.000000
50%     53.000000
75%     75.000000
max    278.000000

In [66]:
df.dtypes

OrderDate        object
Region           object
Manager          object
SalesMan         object
Item             object
Units           float64
 Unit_price      object
Sale_amt         object
dtype: object